// JavaScript sort an array of numbers
// JavaScript-ში რიცხვების მასივის დალაგება შეგიძლიათ sort() მეთოდის გამოყენებით. ჩვეულებრივ, sort() ელემენტებს სტრიქონებად გარდაქმნის და მათ ლექსიკოგრაფიულად ალაგებს. თუმცა, რიცხვების სწორი დალაგებისთვის საჭიროა შედარების ფუნქციის გამოყენება.

 
const numbers1 = [5, 3, 8, 1, 2];

numbers.sort((a, b) => a - b);

console.log(numbers);
 


//2
const numbers = [5, 3, 8, 1, 2];
numbers.sort((a, b) => b - a);
console.log(numbers);


// sort() იღებს შედარების ფუნქციას.

// შედარების ფუნქცია მუშაობს ასე:

// თუ a - b < 0, a აღმოჩნდება წინ.

// თუ a - b > 0, b აღმოჩნდება წინ.

// თუ a - b === 0, ელემენტები უცვლელად რჩება.