// Arrays JavaScript-ში
// Array არის მონაცემების ტიპი JavaScript-ში, რომელიც ინახავს მონაცემთა სიის ფორმატს. იგი საშუალებას გაძლევთ ერთი ცვლადში შეინახოთ მრავალი მნიშვნელობა.

// მახასიათებლები
// ინდექსი: მონაცემები ინახება ინდექსებით, რომლებიც იწყება 0-დან. მაგალითად: პირველი ელემენტის ინდექსია 0, მეორე ელემენტის 1 და ა.შ.

// მრავალტიპიანობა: მასივი შეიძლება შეიცავდეს განსხვავებული ტიპის მონაცემებს (String, Number, Boolean და ა.შ.).

let fruits = ["ვაშლი", "ბანანი", "ფორთოხალი"];

console.log(fruits[0]); 
console.log(fruits[2]); 

fruits.push("ყურძენი");  

console.log(fruits);    


