// სტრინგების მასივის დალაგება JavaScript-ში
// JavaScript-ში სტრინგების მასივის დალაგება ხდება sort() მეთოდის გამოყენებით. ეს მეთოდი აწყობს ელემენტებს ლექსიკოგრაფიულად (ანბანის მიხედვით) დეფოლტური ქცევით.Custom სორტირება (ქართველური ანბანის წესების დასაცავად)
// sort() საშუალებას გაძლევთ გამოიყენოთ სორტირების ფუნქცია, რათა უკეთ დააკონფიგურიროთ შედეგი.
// განმარტება:
// sort(): მასივი დალაგდება Unicode-ის მიხედვით.

// localeCompare(): რეგიონის სპეციფიკის გათვალისწინებით სორტირებისთვის (მაგ., ქართველი ანბანისთვის).



//1
let names = ["ნიკა", "მარიამი", "ლიკა"];
 
names.sort();

console.log(names);  


//2
let names2= ["ნიკა", "მარიამი", "ლიკა"];

names.sort();

console.log(names);




//3
const strings = ["Banana", "Apple", "Cherry", "Date"];

strings.sort();

console.log(strings);

 