// Javascript while loops qartulad
// While ციკლები JavaScript-ში
// while ციკლი გამოიყენება, როცა საჭიროა კოდის განმეორება მანამ, სანამ გარკვეული პირობა true იქნება.

// სტრუქტურა
// javascript
// while (condition) {
// კოდი, რომელიც შესრულდება, სანამ პირობა იქნება true
// }
// მახასიათებლები
// while ციკლი პირველ რიგში ამოწმებს პირობას.

// თუ პირობა true-ია, ციკლი ასრულებს კოდს, შემდეგ ისევ ამოწმებს პირობას.

// ციკლი ჩერდება, როცა პირობა ხდება false.


let count = 1;

while (count <= 5) {
  console.log("რიცხვი: " + count);
  count++; 
}
