// JavaScript array.forEach()
// JavaScript-ის forEach მეთოდი მასივის ყველა ელემენტს ინდივიდუალურად ამუშავებს. ის ასინქრონულად გამოძახებს ფუნქციას თითოეული ელემენტისთვის. forEach არ ქმნის ახალ მასივს, ის უბრალოდ მოქმედებებს ასრულებს არსებულზე.

// აქ არის მარტივი მაგალითი:

 
const numbers = [1, 2, 3, 4, 5];

numbers.forEach((number) => {
  console.log(number * 2);
});

// როგორ მუშაობს:
// forEach იღებს callback ფუნქციას.
// ფუნქციას გადაეცემა სამ არგუმენტად: მიმდინარე ელემენტი, ინდექსი და მთლიანად მასივი.



// JavaScript array.map()
// JavaScript-ის map მეთოდი გამოიყენება მასივის თითოეული ელემენტის გარდასაქმნელად და ახალი მასივის შესაქმნელად. ის არ მოქმედებს ორიგინალ მასივზე, არამედ ქმნის ახალს, სადაც გადამუშავებული მონაცემებია.

// აქ არის მარტივი მაგალითი:
 
const numbers2 = [1, 2, 3, 4, 5];

const doubled = numbers.map((number) => number * 2);

console.log(doubled); 
 



