// For ციკლები JavaScript-ში
// for ციკლი გამოიყენება, როცა გვსურს კოდი განმეორდეს კონკრეტული რაოდენობისჯერ. ის უზრუნველყოფს ინიციალიზაციის, პირობის და განახლების წერტილების მარტივ გამოყენებას.

// სტრუქტურა
// javascript
// for (initialization; condition; update) {
 // კოდი, რომელიც შესრულდება ციკლში
// }
// მახასიათებლები
// Initialization: ცვლადის ინიციალიზაცია (მხოლოდ ერთხელ, ციკლის დასაწყისში).

// Condition: შეამოწმებს, უნდა გაგრძელდეს თუ არა ციკლი.

// Update: განაახლებს ცვლადს ყოველ განმეორებაზე.



for (let i = 1; i <= 5; i++) {
    console.log("რიცხვი: " + i);
  }
  

//   ამ მაგალითში, for ციკლი:

// ინიციალიზებს i = 1.

// ამოწმებს პირობას i <= 5.

// ყოველ განმეორებაზე ზრდის i-ს 1-ით (i++).