// JavaScript ცვლადები
// ცვლადები (Variables) არის კონტეინერები, რომლებიც მონაცემებს ინახავენ. ცვლადები შეიძლება გამოცხადდეს სამი სიტყვით:

// var: ძველი სინტაქსისთვის, დღეს ნაკლებად რეკომენდირებული.

// let: ცვლადებისთვის, რომელთა მნიშვნელობა შეიძლება შეიცვალოს.

// const: მუდმივი ცვლადებისთვის, რომლებიც ვერ შეიცვლება.

// JavaScript მონაცემთა ტიპები
// Number: რიცხვები (integer ან float).

// String: ტექსტი, რომელიც ინახება ბრჭყალებში.

// Boolean: ლოგიკური მნიშვნელობა (true ან false).

// Null: ცარიელი მნიშვნელობა.

// Undefined: ცვლადი, რომელსაც მნიშვნელობა არ აქვს.

// Object: მონაცემთა შედგობები (მონაცემთა სტრუქტურები).

// Array




// var, let, const
// var ყველაზე პრიმიტიული და სუსტი ცვლადია, რომელიც JavaScript-ის ადრეულ ვერსიებში იყო გამოყენებული.
var name = "ilia"; 
var age = 30;  
var isStudent = true;  
 

// let არის უფრო თანამედროვე და ძლიერი ცვლადი, რომელიც საშუალებას გაძლევთ შეცვალოთ მისი მნიშვნელობა.
let name = "ilia";
let age = 30;
let isStudent = true;


// const არის მუდმივი ცვლადი, რომლის მნიშვნელობა არ შეიძლება შეიცვალოს.
const name = "ilia";
const age = 30;
const isStudent = true;