// String-ის დაჭრა (Slicing) JavaScript-ში
// JavaScript-ში String-ის slicing არის პროცესი, რომლის დროსაც სტრინგის ნაწილის არჩევა შესაძლებელია ფუნქციის საშუალებით slice(). იგი საშუალებას გაძლევთ აირჩიოთ სტრინგის დიაპაზონი და შექმნათ ახალი სტრინგი, რომელიც შეიცავს მხოლოდ ამ მონაკვეთს.
// slice() მეთოდი
// slice(start, end):

// start: აჩვენებს სტრინგის საწყის პოზიციას (ინდექსით).

// end (არასავალდებულო): აჩვენებს საბოლოო პოზიციას (არ შეიცავს ამ ინდექსს).

// მახასიათებლები:
// ინდექსაცია იწყება 0-დან.

// ნეგატიური მნიშვნელობები ითვლის ინდექსს სტრინგის ბოლოდან.

// slice() მეთოდი ქმნის ახალ სტრინგს და არ ცვლის ორიგინალ სტრინგს.

// იგი ფართოდ გამოიყენება ტექსტის მანიპულაციისთვის, როდესაც საჭირო ხდება ტექსტის კონკრეტული ნაწილის გამოყოფა.





 
 
//1
 
let text1 = "გამარჯობა, მეგობარო!";
let slicedText1 = text.slice(0, 9); 
// მხოლოდ საწყისი ინდექსი:

 
let text2 = " js";
let slicedText2 = text.slice(4);  
// ნეგატიური ინდექსები:

 
let text3 = "გამარჯობა";
let slicedText3 = text.slice(-5);  
// დიაპაზონის გარეშე:

 
let text4 = "გამარჯობა";
let slicedText4 = text.slice();  