// JavaScript-ის if განცხადებები
// if განცხადებები გამოიყენება, რათა პროგრამამ შეამოწმოს პირობა და შესაბამისად შეასრულოს კოდი.

// სტრუქტურა: if ბლოკი შესრულდება მხოლოდ მაშინ, თუ მოცემული პირობა true-ია.

// შეიძლება გამოყენებულ იქნას else და else if, რათა დაამატოთ დამატებითი პირობები ან ალტერნატიული სცენარები.

let age = 20;

if (age >= 18) {
  console.log("თქვენ ხართ სრულწლოვანი!");
}


// JavaScript Else-ის მაგალითი
// else გამოიყენება, როცა if-ის პირობა false-ია და პროგრამამ უნდა შეასრულოს ალტერნატიული კოდი.

let age1 = 17;

if (age >= 18) {
  console.log("თქვენ ხართ სრულწლოვანი!");
} else {
  console.log("თქვენ ხართ არასრულწლოვანი!");
}


// If-Else განცხადებების მაგალითი JavaScript-ში
// JavaScript-ში if-else განცხადება გამოიყენება, რათა პროგრამამ შეამოწმოს პირობა და შესაბამისი კოდი შეასრულოს თუ ის მართალია, ან თუ ის მცდარია.


let score = 75;

if (score >= 90) {
  console.log("შესანიშნავი ნიშანი!");
} else {
  console.log("კარგია, მაგრამ შეიძლება გაუმჯობესება!");
}
