// avaScript-ის String მეთოდები
//  js-ში String მეთოდები გამოიყენება ტექსტის დასამუშავებლად და სხვადასხვა ოპერაციების შესასრულებლად. აქ არის ყველაზე ხშირად გამოყენებადი String მეთოდები:


// length აბრუნებს სტრინგის სიმბოლოების რაოდენობას.

 
let str1 = "გამარჯობა";
console.log(str.length); // 9
// toUpperCase() გარდაქმნის ტექსტს მთლიანად დიდ ასოებად.

 
let str2 = "გამარჯობა";
console.log(str.toUpperCase()); // "გამარჯობა"
// toLowerCase() გარდაქმნის ტექსტს მთლიანად პატარა ასოებად.

 
let str3= "გამარჯობა";
console.log(str.toLowerCase()); // "გამარჯობა"
// trim() შლის ცარიელ ადგილებს სტრინგის დასაწყისში და ბოლოში.

 
let str4 = "  გამარჯობა  ";
console.log(str.trim()); // "გამარჯობა"
// includes() ამოწმებს, შეიცავს თუ არა სტრინგი კონკრეტულ ტექსტს.

 
let str5 = "გამარჯობა, როგორ ხარ?";
console.log(str.includes("როგორ")); // true
// indexOf() აბრუნებს კონკრეტული ტექსტის პირველ პოზიციას სტრინგში.

 
let str6 = "გამარჯობა";
console.log(str.indexOf("ა")); // 2
// slice() აჭრის სტრინგს კონკრეტული დიაპაზონის მიხედვით.

 
let str7 = "გამარჯობა";
console.log(str.slice(0, 5)); // "გამარჯ"
// replace() ცვლის სტრინგის ნაწილს სხვა მნიშვნელობით.

 
let str8 = "გამარჯობა";
console.log(str.replace("გამარჯობა", "ნახვამდის")); // "ნახვამდის"
// split() შლის სტრინგს ნაწილებად და ქმნის მასივს.

 
let str = "გამარჯობა,როგორ,ხარ";
console.log(str.split(",")); // ["გამარჯობა", "როგორ", "ხარ"]
// concat() აერთიანებს ორ ან მეტ სტრინგს.

 
let str19 = "გამარჯობა";
let str29 = "მეგობარო";
console.log(str1.concat(" ", str2)); // "გამარჯობა მეგობარო"