# Learn Python VARIABLES

# Python ცვლადები (Variables) არის პროგრამირების ძირითადი ელემენტები, რომლებიც მონაცემებს ინახავენ და პროგრამაში სხვადასხვა ადგილას იყენებენ. ცვლადების შექმნა და გამოყენება Python-ში ძალიან მარტივია.


age = 35
print(age)

name= "ნიკოლოზ"
age = 25

print(name)
print(age)

# ცვლადების სახელი უნდა იწყებოდეს ასოებით ან ქვედა ხაზით (_), შემდეგ კი შეიძლება შეიცავდეს ასოებს, ციფრებს და ქვედა ხაზებს. Python-ში ცვლადების სახელი არ უნდა იწყებოდეს ციფრით.
# ცვლადების სახელი უნდა იყოს მკაფიო და აღწერითი, რათა ადვილად გაიგოთ, რას ინახავს იგი. მაგალითად, თუ ცვლადი ინახავს მომხმარებლის ასაკს, მისი სახელი შეიძლება იყოს "user_age" ან "age".



name="ნიკოლოზ"
age = 25
is_student = True
height = 1.75
weight = 70.5

# ამათ მერე ისწავლით




person = ""
name = "Luka"
age = 10
height = 1.62
status = "Student in Goal oriented academy"
is_student = True
