# Python-ში ლოგიკური ოპერატორები გამოიყენება პირობითი განცხადებების კომბინირებისთვის და ბულიანი (Boolean) გამოსახულებების შესაფასებლად. აი, ძირითადი ლოგიკური ოპერატორები:

# 1. and ოპერატორი:
# აბრუნებს True-ს, თუ ორივე პირობა მართალია.

x = 5
print(x > 3 and x < 10)


# 2. or ოპერატორი:
# აბრუნებს True-ს, თუ მინიმუმ ერთი პირობა მართალია.

x = 5
print(x > 3 or x > 10)  

# 3 not ოპერატორი:
# აბრუნებს პირიქით შედეგს: False, თუ პირობა მართალია, და True, თუ პირობა მცდარია.

x = 5
print(not(x > 3 and x < 10))   

