// [ ] ქმნის ახალ მასივს
// new Array() ქმნის ახალ მასივს
// at() აბრუნებს მასივის ინდექსირებულ ელემენტს
// concat() აკავშირებს მასივებს და აბრუნებს მასივს შეერთებული მასივებით
// constructor აბრუნებს ფუნქციას, რომელმაც შექმნა მასივის პროტოტიპი
// copyWithin() კოპირებს მასივის ელემენტებს, მითითებულ პოზიციებზე და მითითებულ პოზიციებზე
// entries() აბრუნებს გასაღების/მნიშვნელობის წყვილს მასივის იტერაციის ობიექტი
// every() ამოწმებს, გადის თუ არა მასივის ყველა ელემენტი ტესტს
// fill() ავსებს მასივის ელემენტებს სტატიკური მნიშვნელობით
// filter() ქმნის ახალ მასივს მასივის ყველა ელემენტით, რომელიც გადის ტესტს
// find() აბრუნებს მასივის პირველი ელემენტის მნიშვნელობას, რომელიც გადის ტესტს
// findIndex() აბრუნებს მასივის პირველი ელემენტის ინდექსს, რომელიც გადის ტესტს
// findLast() აბრუნებს მასივის ბოლო ელემენტის მნიშვნელობას, რომელიც გადის ტესტს
// findLastIndex() აბრუნებს მასივის ბოლო ელემენტის ინდექსს, რომელიც გადის ტესტს
// flat() აერთიანებს ქვემასივის ელემენტებს
// flatMap() ასახავს მასივის ყველა ელემენტს და ქმნის ახალ ბრტყელ მასივს
// forEach() იძახებს ფუნქციას მასივის თითოეული ელემენტისთვის
// from() ქმნის მასივს ობიექტიდან
// includes() ამოწმებს, შეიცავს თუ არა მასივი მითითებულ ელემენტს
// indexOf() ეძებს ელემენტს მასივში და აბრუნებს მის პოზიციას
// isArray() ამოწმებს, არის თუ არა ობიექტი მასივი
// join() აერთიანებს მასივის ყველა ელემენტს სტრიქონში
// keys() აბრუნებს მასივის იტერაციის ობიექტს, რომელიც შეიცავს ორიგინალური მასივის გასაღებებს
// lastIndexOf() ეძებს ელემენტს მასივში, დაწყებული ბოლოდან, და აბრუნებს მის პოზიციას
// length ადგენს ან აბრუნებს მასივში ელემენტების რაოდენობას
// map() ქმნის ახალ მასივს მასივის თითოეული ელემენტისთვის ფუნქციის გამოძახების შედეგით
// of() ქმნის მასივს არგუმენტების რაოდენობის მიხედვით
// pop() შლის მასივის ბოლო ელემენტს და აბრუნებს ამ ელემენტს
// პროტოტიპი საშუალებას გაძლევთ დაამატოთ თვისებები და მეთოდები მასივის ობიექტს
// push() ამატებს ახალ ელემენტებს მასივის ბოლოს და აბრუნებს ახალ სიგრძეს
// reduce() ამცირებს მასივის მნიშვნელობებს ერთ მნიშვნელობამდე (მარცხნიდან მარჯვნივ)
// reduceRight() ამცირებს მასივის მნიშვნელობებს ერთ მნიშვნელობამდე (მარჯვნიდან მარცხნივ)
// reverse() ცვლის მასივის ელემენტების თანმიმდევრობას
// shift() შლის მასივის პირველ ელემენტს და აბრუნებს ამ ელემენტს
// slice() ირჩევს მასივის ნაწილს და აბრუნებს ახალ მასივს
// some() ამოწმებს, გადის თუ არა მასივის რომელიმე ელემენტი ტესტს
// sort() სორტირებას უკეთებს მასივის ელემენტებს
// splice() ამატებს ან შლის მასივის ელემენტებს
// toReversed() ცვლის მასივის ელემენტების თანმიმდევრობას (ახალ მასივში)
// toSorted() სორტირებას უკეთებს მასივის ელემენტებს (ახალ მასივში)
// toSpliced() მასივის ელემენტებს ამატებს ან შლის (ახალ მასივში)
// toString() მასივს სტრიქონად გარდაქმნის და შედეგს აბრუნებს
// unshift() მასივის დასაწყისში ახალ ელემენტებს ამატებს და ახალ სიგრძეს აბრუნებს
// valueOf() მასივის პრიმიტიულ მნიშვნელობას აბრუნებს
// with() განახლებული ელემენტებით ახალ მასივს აბრუნებს