// decodeURI() ახდენს URI-ს დეკოდირებას
// decodeURI
// Component() ახდენს URI კომპონენტის დეკოდირებას
// encodeURI() ახდენს URI-ს კოდირებას
// encodeURI
// Component() ახდენს URI კომპონენტის კოდირებას
// escape() მოძველებულია. გამოიყენეთ ამის ნაცვლად:
// encodeURI()
// encodeURIComponent()
// eval() აფასებს სტრიქონს და ასრულებს მას ისე, თითქოს ის სკრიპტის კოდი იყოს
// Infinity რიცხვითი მნიშვნელობა, რომელიც წარმოადგენს დადებით/უარყოფით უსასრულობას
// isFinite() განსაზღვრავს, არის თუ არა მნიშვნელობა სასრული, კანონიერი რიცხვი
// isNaN() განსაზღვრავს, არის თუ არა მნიშვნელობა დაუშვებელი რიცხვი
// NaN "არა-რიცხვი" მნიშვნელობა
// Number() გარდაქმნის ობიექტის მნიშვნელობას რიცხვად
// parseFloat() აანალიზებს სტრიქონს და აბრუნებს მცურავ წერტილოვან რიცხვს
// parseInt() აანალიზებს სტრიქონს და აბრუნებს მთელ რიცხვს
// String() გარდაქმნის ობიექტის მნიშვნელობას სტრიქონად
// undefined მიუთითებს, რომ ცვლადს არ აქვს მინიჭებული მნიშვნელობა
// unescape() მოძველებულია. გამოიყენეთ ამის ნაცვლად:
// decodeURI()