// new Map() ქმნის ახალ Map ობიექტს
// clear() შლის Map-დან ყველა ელემენტს
// delete() შლის გასაღებით მითითებულ Map ელემენტს
// entries() აბრუნებს Map-ში [key, value] წყვილების მქონე იტერატორ ობიექტს
// forEach() იწვევს Map-ში თითოეული გასაღები/მნიშვნელობის წყვილისთვის უკუკავშირს
// get() იღებს Map-ში გასაღების მნიშვნელობას
// groupBy() აჯგუფებს ობიექტის ელემენტებს დაბრუნებული უკუკავშირის მნიშვნელობების მიხედვით
// has() აბრუნებს true-ს, თუ გასაღები არსებობს Map-ში
// keys() აბრუნებს Map-ში გასაღებების მქონე იტერატორ ობიექტს
// set() ადგენს Map-ში გასაღების მნიშვნელობას
// size აბრუნებს Map ელემენტების რაოდენობას
// values() აბრუნებს Map-ში მნიშვნელობების მქონე იტერატორ ობიექტს