// abs(x) აბრუნებს x-ის აბსოლუტურ მნიშვნელობას
// acos(x) აბრუნებს x-ის არკკოზინს, რადიანებში
// acosh(x) აბრუნებს x-ის ჰიპერბოლურ არკკოზინს
// asin(x) აბრუნებს x-ის არკკოზინს, რადიანებში
// asinh(x) აბრუნებს x-ის ჰიპერბოლურ არკკოზინს
// atan(x) აბრუნებს x-ის არკტანგენსს, როგორც რიცხვით მნიშვნელობას -PI/2 და PI/2 რადიანებს შორის
// atan2(y, x) აბრუნებს მისი არგუმენტების კოეფიციენტის არკტანგენსს
// atanh(x) აბრუნებს x-ის ჰიპერბოლურ არკტანგენსს
// cbrt(x) აბრუნებს x-ის კუბურ ფესვს
// ceil(x) აბრუნებს x-ს, დამრგვალებულს ზემოთ უახლოეს მთელ რიცხვამდე
// clz32(x) აბრუნებს x-ის 32-ბიტიან ორობით წარმოდგენაში საწყისი ნულების რაოდენობას
// cos(x) აბრუნებს x-ის კოსინუსს (x არის რადიანებში)
// cosh(x) აბრუნებს x-ის ჰიპერბოლურ კოსინუსს x
// E აბრუნებს ეილერის რიცხვს (დაახლოებით 2.718)
// exp(x) აბრუნებს Ex-ის მნიშვნელობას
// expm1(x) აბრუნებს Ex-ის მნიშვნელობას მინუს 1
// floor(x) აბრუნებს x-ს, დამრგვალებულს ქვევით უახლოეს მთელ რიცხვამდე
// fround(x) აბრუნებს რიცხვის უახლოეს (32-ბიტიანი ერთსიზუსტიანი) მცურავი რიცხვის წარმოდგენას
// LN2 აბრუნებს 2-ის ბუნებრივ ლოგარითმს (დაახლოებით 0.693)
// LN10 აბრუნებს 10-ის ბუნებრივ ლოგარითმს (დაახლოებით 2.302)
// log(x) აბრუნებს x-ის ბუნებრივ ლოგარითმს
// log10(x) აბრუნებს x-ის ათობით ლოგარითმს
// LOG10E აბრუნებს E-ს ათობით ლოგარითმს (დაახლოებით 0.434)
// log1p(x) აბრუნებს 1 + x-ის ბუნებრივ ლოგარითმს
// log2(x) აბრუნებს x-ის 2-ობით ლოგარითმს
// LOG2E აბრუნებს E-ს 2-ობით ლოგარითმს (დაახლოებით 1.442)
// max(x1,x2,..) აბრუნებს ყველაზე მაღალი მნიშვნელობის მქონე რიცხვს
// min(x1,x2,..) აბრუნებს ყველაზე დაბალი მნიშვნელობის მქონე რიცხვს
// PI აბრუნებს PI (დაახლოებით 3.14)
// pow(x, y) აბრუნებს x-ის მნიშვნელობას ხარისხში y
// random() აბრუნებს შემთხვევით რიცხვს 0-დან 1-მდე
// round(x) ამრგვალებს x-ს უახლოეს მთელ რიცხვამდე
// sign(x) აბრუნებს რიცხვის ნიშანს (ამოწმებს, დადებითია თუ ნული)
// sin(x) აბრუნებს x-ის სინუსს (x არის რადიანებში)
// sinh(x) აბრუნებს x-ის ჰიპერბოლურ სინუსს
// sqrt(x) აბრუნებს x-ის კვადრატულ ფესვს
// SQRT1_2 აბრუნებს 1/2-ის კვადრატულ ფესვს (დაახლოებით 0.707)
// SQRT2 აბრუნებს 2-ის კვადრატულ ფესვს (დაახლოებით 1.414)
// tan(x) აბრუნებს კუთხის ტანგენსს
// tanh(x) აბრუნებს რიცხვის ჰიპერბოლურ ტანგენსს
// trunc(x) აბრუნებს რიცხვის მთელ ნაწილს (x)