// კონსტრუქტორი აბრუნებს ფუნქციას, რომელმაც შექმნა JavaScript-ის რიცხვის პროტოტიპი
// EPSILON აბრუნებს 1-სა და 1-ზე მეტ უმცირეს რიცხვს შორის სხვაობას
// isFinite() ამოწმებს, არის თუ არა მნიშვნელობა სასრული რიცხვი
// isInteger() ამოწმებს, არის თუ არა მნიშვნელობა მთელი რიცხვი
// isNaN() ამოწმებს, არის თუ არა მნიშვნელობა Number.NaN
// isSafeInteger() ამოწმებს, არის თუ არა მნიშვნელობა უსაფრთხო მთელი რიცხვი
// MAX_SAFE_INTEGER აბრუნებს JavaScript-ის მაქსიმალურ უსაფრთხო მთელ რიცხვს. MIN_SAFE_INTEGER აბრუნებს JavaScript-ში მინიმალურ უსაფრთხო მთელ რიცხვს
// MAX_VALUE აბრუნებს JavaScript-ში შესაძლო უდიდეს რიცხვს
// MIN_VALUE აბრუნებს JavaScript-ში შესაძლო უმცირეს რიცხვს
// NaN წარმოადგენს "არარიცხვი" მნიშვნელობას
// NEGATIVE_INFINITY წარმოადგენს უარყოფით უსასრულობას (ბრუნდება გადავსებისას)
// POSITIVE_INFINITY წარმოადგენს უსასრულობას (ბრუნდება გადავსებისას)
// parseFloat() ამუშავებს სტრიქონს და აბრუნებს რიცხვს
// parseInt() ამუშავებს სტრიქონს და აბრუნებს მთელ რიცხვს
// prototype საშუალებას გაძლევთ დაამატოთ თვისებები და მეთოდები ობიექტს
// toExponential(x) გარდაქმნის რიცხვს ექსპონენციალურ ნოტაციაში
// toFixed(x) აფორმებს რიცხვს ათწილადის წერტილის შემდეგ x რაოდენობის ციფრებით
// toLocaleString() გარდაქმნის რიცხვს სტრიქონად, ლოკალის პარამეტრების მიხედვით
// toPrecision(x) აფორმებს რიცხვს x სიგრძით
// toString() გარდაქმნის რიცხვს სტრიქონად
// valueOf() აბრუნებს რიცხვის პრიმიტიულ მნიშვნელობას