// assign() კოპირებს თვისებებს საწყისი ობიექტიდან სამიზნე ობიექტზე
// constructor აბრუნებს ფუნქციას, რომელმაც შექმნა ობიექტის პროტოტიპი
// create() აბრუნებს არსებული ობიექტიდან შექმნილ ობიექტს
// defineProperties() ამატებს ან ცვლის თვისებებს
// defineProperty() ამატებს ან ცვლის თვისებას
// entries() აბრუნებს ობიექტის გასაღები/მნიშვნელობის წყვილების მასივს
// freeze() ხელს უშლის ობიექტში რაიმე ცვლილებას
// fromEntries() აბრუნებს გასაღები/მნიშვნელობის წყვილების განმეორებადი სიიდან შექმნილ ობიექტს
// getOwnPropertyDescriptor() აბრუნებს ობიექტის გასაღებების მასივს
// getOwnPropertyDescriptors() აბრუნებს ობიექტის გასაღებების მასივს
// getOwnPropertyNames() აბრუნებს ობიექტის გასაღებების მასივს
// groupBy() აჯგუფებს ობიექტის ელემენტებს დაბრუნებული უკუკავშირის მნიშვნელობების მიხედვით
// isExtensible() აბრუნებს true-ს, თუ ობიექტი გაფართოებადია
// isFrozen() აბრუნებს true-ს, თუ ობიექტი გაყინულია
// isSealed() აბრუნებს true-ს, თუ ობიექტი დალუქულია
// keys() აბრუნებს ობიექტის გასაღებების მასივს
// preventExtensions() ხელს უშლის ობიექტში ახალი თვისებების დამატებას
// prototype საშუალებას გაძლევთ დაამატოთ თვისებები და მეთოდები JavaScript ობიექტებში
// seal() ხელს უშლის ობიექტის ახალი თვისებების დამატებას ან არსებული თვისებების წაშლას
// toString() გარდაქმნის ობიექტს სტრიქონად და აბრუნებს შედეგს
// valueOf() აბრუნებს ობიექტის პრიმიტიულ მნიშვნელობას
// values() აბრუნებს ობიექტის თვისებების მნიშვნელობების მასივს