// at() აბრუნებს ინდექსირებულ სიმბოლოს სტრიქონიდან
// charAt() აბრუნებს სიმბოლოს მითითებულ ინდექსზე (პოზიციაზე)
// charCodeAt() აბრუნებს სიმბოლოს უნიკოდს მითითებულ ინდექსზე
// codePointAt() აბრუნებს უნიკოდის მნიშვნელობას სტრიქონში ინდექსზე (პოზიციაზე)
// concat() აბრუნებს ორ ან მეტ შეერთებულ სტრიქონს
// constructor აბრუნებს სტრიქონის კონსტრუქტორ ფუნქციას
// endsWith() აბრუნებს, თუ სტრიქონი მთავრდება მითითებული მნიშვნელობით
// fromCharCode() აბრუნებს უნიკოდის მნიშვნელობებს სიმბოლოებად
// includes() აბრუნებს, თუ სტრიქონი შეიცავს მითითებულ მნიშვნელობას
// indexOf() აბრუნებს მნიშვნელობის პირველი გამოჩენის ინდექსს (პოზიციას) სტრიქონში
// lastIndexOf() აბრუნებს მნიშვნელობის ბოლო გამოჩენის ინდექსს (პოზიციას) სტრიქონში
// length აბრუნებს სტრიქონის სიგრძეს
// localeCompare() ადარებს ორ სტრიქონს მიმდინარე ლოკალში
// match() ეძებს სტრიქონს მნიშვნელობას ან რეგულარულ გამოსახულებას და აბრუნებს შესაბამისობებს
// padEnd() ათავსებს სტრიქონს შიგთავსში end
// padStart() ავსებს სტრიქონს დასაწყისიდან
// prototype საშუალებას გაძლევთ დაამატოთ თვისებები და მეთოდები ობიექტს
// repeat() აბრუნებს ახალ სტრიქონს სტრიქონის ასლების რაოდენობის მიხედვით
// replace() ეძებს სტრიქონს შაბლონისთვის და აბრუნებს სტრიქონს, სადაც პირველი დამთხვევა ჩანაცვლებულია
// replaceAll() ეძებს სტრიქონს შაბლონისთვის და აბრუნებს ახალ სტრიქონს, სადაც ყველა დამთხვევა ჩანაცვლებულია
// search() ეძებს სტრიქონს მნიშვნელობას ან რეგულარულ გამოსახულებას და აბრუნებს დამთხვევის ინდექსს (პოზიციას)
// slice() იღებს სტრიქონის ნაწილს და აბრუნებს ახალ სტრიქონს
// split() ყოფს სტრიქონს ქვესტრიქონების მასივად
// startsWith() ამოწმებს, იწყება თუ არა სტრიქონი მითითებული სიმბოლოებით
// substr() მოძველებულია. გამოიყენეთ substring() ან slice(). substring() სტრიქონიდან სიმბოლოების ამოღება, ორ მითითებულ ინდექსს (პოზიციებს) შორის
// toLocaleLowerCase() აბრუნებს პატარა ასოებად გადაკეთებულ სტრიქონს, ჰოსტის ლოკალის გამოყენებით
// toLocaleUpperCase() აბრუნებს დიდ ასოებად გადაკეთებულ სტრიქონს, ჰოსტის ლოკალის გამოყენებით
// toLowerCase() აბრუნებს პატარა ასოებად გადაკეთებულ სტრიქონს
// toString() აბრუნებს სტრიქონს ან სტრიქონის ობიექტს, როგორც სტრიქონს
// toUpperCase() აბრუნებს დიდ ასოებად გადაკეთებულ სტრიქონს
// trim() აბრუნებს სტრიქონს წაშლილი ცარიელი ადგილებით
// trimEnd() აბრუნებს სტრიქონს ბოლოდან წაშლილი ცარიელი ადგილებით
// trimStart() აბრუნებს სტრიქონს დასაწყისიდან წაშლილი ცარიელი ადგილებით
// valueOf() აბრუნებს სტრიქონის ან სტრიქონის ობიექტის პრიმიტიულ მნიშვნელობას


