// Do-While ციკლები JavaScript-ში
// do-while ციკლი გამოიყენება, როცა გვსურს კოდი შესრულდეს მინიმუმ ერთხელ და შემდეგ გაგრძელდეს განმეორება, სანამ გარკვეული პირობა true იქნება.

// სტრუქტურა
// javascript
// do {
//   /ოდი, რომელიც შესრულდება მინიმუმ ერთხელ
// } while (condition);
// მახასიათებლები
// კოდი მინიმუმ ერთხელ შესრულდება, მიუხედავად იმისა, პირობა მართალია თუ არა.

// შემდეგ, თითოეულ განმეორებაზე, პირობა condition

let count = 1;

do {
  console.log("რიცხვი: " + count);
  count++; 
} while (count <= 5);
