# lesson21
#  *ARGS & **KWARGS

# პითონში *args და **kwargs გამოიყენება ფუნქციების განმარტებებში, რათა 
# დაუშვას არგუმენტების ცვლადი რაოდენობა. *args გაძლევთ საშუალებას
# გადასცეთ პოზიციური არგუმენტების ცვლადი რაოდენობა, ხოლო **kwargs 
# გაძლევთ საშუალებას გადასცეთ საკვანძო სიტყვების არგუმენტები ლექსიკონის 
# სახით. ეს მოქნილობა სასარგებლოა, როცა წინასწარ არ იცი რამდენი არგუმენტი
# შეიძლება გადაეცეს
# ფუნქციას.

def example(arg1, arg2, *args, kwarg1=None, **kwargs):
    print(arg1, arg2)
    print(args)
    print(kwarg1)
    print(kwargs)

example(1, 2, 3, 4, kwarg1='test', key1='value1')