# გსკვეზტილი 3 
# Type casting in Python 

# პითონში ტიპის ჩამოსხმა გულისხმობს მონაცემთა ერთი ტიპის მეორეზე გადაქცევის პროცესს. ის საშუალებას 
# გაძლევთ შეცვალოთ ცვლადის ტიპი, რათა შეესაბამებოდეს მონაცემთა სასურველ ტიპს. პითონი უზრუნველყოფს ჩაშენებულ ფუნქციებს ამ 
# კონვერტაციის შესასრულებლად (ასევე ცნობილია როგორც ტიპის კონვერტაცია).მაგ

# explicit metod

# მაგალითი 1

name ="ilia"
age = 14
gpa = 1.9
student = True
# print(type(name)) #გამოიტანს str რადგან სტრინგია
# ჩვენ ასევე შეგვიძლია ინტეჯერი გამოვსახოთ სხვა ნაირად მაგ ფლოათი სტრინგი და ასე შემდეგ
# age = float(age)
# print(age)