# გაკვეთილი 11
# Format specifiers in Python are awesome

# პითონში ფორმატის სპეციფიკაციები ნამდვილად ძლიერია და საშუალებას გაძლევთ სტრინგებში ეფექტურად ჩააბათ 
# ცვლადები და მონაცემები სპეციალურ ფორმატში. ამისთვის პითონი იყენებს format() მეთოდს და f-strings (ფორმატირებულ სტრინგებს), რომლებიც
# მარტივად და სწრაფად იყენებენ ცვლადებს სტრინგებში.

# 1. format() მეთოდი
# format() მეთოდი საშუალებას გაძლევთ ჩააბათ ცვლადები სტრინგებში {} ფრჩხილებით.

name = "Alice"
age = 30

print(f"My name is {name} and I am {age} years old.")


# 2. f-სტრიქონების გამოყენება (ფორმატირებული სიმებიანი ლიტერალები):
# Python 3.6-ში დანერგილი f-strings არის უფრო თანამედროვე და ლაკონური გზა სტრიქონების ფორმატირებისთვის.
#  თქვენ უბრალოდ დააწერთ სტრიქონს f და ჩასვით გამონათქვამები ხვეული ბრეკეტებში {}.
#  ის ავტომატურად აფასებს გამონათქვამებს ბრეკეტების შიგნით.


name = "John"
age = "46"

print(f"you are{age} yers old and your name is{name}")