# lesson35
# Python POLYMORPHISM 

# პითონის პოლიმორფიზმი
# პითონის პოლიმორფიზმი
# პოლიმორფიზმი (განვრცობილი ქართულად როგორც "ბევრი ფორმა") არის
# ობიექტურად ორიენტირებული პროგრამირების ერთ-ერთი მნიშვნელოვანი
# კონცეფცია, 
# რომელიც საშუალებას იძლევა, რომ ერთსა და იმავე სახელით სხვადასხვა 
# ტიპის ობიექტებზე მოქმედებები შესრულდეს განსხვავებულად. პოლიმორფიზმი 
# ძირითადად ორი ტიპისაა:

# მეთოდების პოლიმორფიზმი – როდესაც ერთსა და იმავე სახელის მქონე 
# მეთოდები სხვადასხვა კლასებში სხვადასხვა ფორმით მუშაობს.
# ოპერატორის პოლიმორფიზმი – როდესაც ერთი და იგივე ოპერატორი 
# (მაგალითად, +, -) სხვადასხვა ტიპის მონაცემებზე სხვადასხვა მოქმედებას 
# ასრულებს.
# პოლიმორფიზმის ტიპები პითონში
# თაბლეტური პოლიმორფიზმი (Method Overriding) – როდესაც ქვეკლასი ღ
# ებულობს იგივე მეთოდს, როგორც მის მშობელ კლასში, მაგრამ ის ახორციელებს
# მის განსხვავებულ რეალიზაციას.

# გრაფიკული პოლიმორფიზმი (Method Overloading) – ეს უფრო დინამიკური 
# ტიპის ცვლადების საშუალებით ხორციელდება პითონში, თუმცა პითონს არ 
# აქვს პირდაპირი მხარდაჭერა მეთოდის გადატვირთვისთვის, როგორც სხვა ენებში 
# (მაგალითად, Java-ში).

# მეთოდების პოლიმორფიზმი (Method Overriding)
# ეს არის ყველაზე გავრცელებული სახის პოლიმორფიზმი, როდესაც 
# შვილკლასში ღებულდება იგივე სახელის მქონე მეთოდი, მაგრამ სხვა
# რეალიზაციით.



