# lesson20
# Python keyword arguments
# პითონის საკვანძო სიტყვების არგუმენტები

# პითონის საკვანძო სიტყვების არგუმენტები (Keyword   Arguments) არის ისეთი 
# არგუმენტები, რომლებიც გადაცემული იქმნება არა პოზიციურად 
# (მიუხედავად მათი წარდგენის რიგისა), არამედ არგუმენტის სახელის
# მითითებით. ეს ნიშნავს, რომ როდესაც ფუნქციას ვუძახებთ, ჩვენ
# შეგვიძლია პარამეტრებს მივუთითოთ სახელი, და ამით პითონი„გაგვაგებინებს“
# , რომ რომელ პარამეტრს ვაწვდით მონაცემებს.


# 1. საკვანძო არგუმენტები პირდაპირ გადაცემა

def greet(name, greeting="Hello"):
    print(f"{greeting}, {name}!")


greet(name="Alice")  
greet(name="Bob", greeting="Good evening")  
#  როდესაც გადავცემთ არგუმენტებს საკვანძო ფორმით, არ აქვს
# მნიშვნელობა, 
# რომელი არგუმენტი მივუთითეთ პირველად.

# 2. პოზიციური და საკვანძო არგუმენტების კომბინაცია
# თუ ფუნქციას გაქვს როგორც პოზიციური, ისე საკვანძო არგუმენტები,
# მაშინ პოზიციური არგუმენტები უნდა გადაეცეს პირველ რიგში, ხოლო 
# საკვანძო არგუმენტები – შემდეგ.

def describe_person(name, age, city="Unknown"):
    print(f"{name} is {age} years old and lives in {city}.")


describe_person("Alice", 25)  
describe_person("Bob", 30, city="New York") 

# 3. ყველა არგუმენტის გადაცემა საკვანძო ფორმით
# შენიშვნა: პითონში შესაძლებელია ყველა არგუმენტი საკვანძო ფორმით
# გადაცემულ
# იქნას, რათა თავიდან ავიცილოთ ვირუსული სიჩქარე.

def calculate_price(item, price, discount=0.1, tax=0.2):
    total = price - (price * discount) + (price * tax)
    print(f"The total price for {item} is: {total:.2f}")
calculate_price(item="Laptop", price=1000, discount=0.15, tax=0.18)


# 4. პოზიციური და საკვანძო არგუმენტების გადაცემის წესები
# პოზიციური არგუმენტები: ეს არის ჩვეულებრივი არგუმენტები, რომლებიც ფუნქციაში გადაეცემა მათი ადგილმდებარეობის მიხედვით.
# საკვანძო არგუმენტები: ეს არის არგუმენტები, რომლებიც ფუნქციაში გადაცემულია მათი სახელების მიხედვით.
# 5. ტესტი ვაკანსია

def print_address(street, city, state, zip_code):
    print(f"Street: {street}, City: {city}, State: {state}, Zip: {zip_code}")

