# გაკვეთილი 14
# Nested loops in Python

# პითონში, წყობილი მარყუჟები არის მარყუჟები, რომლებიც მოთავსებულია სხვა მარყუჟების შიგნით. ეს ნიშნავს, რომ ერთი მარყუჟი 
# მოთავსებულია მეორე მარყუჟის სხეულში. თქვენ შეგიძლიათ გამოიყენოთ ჩასმული მარყუჟები, როდესაც გჭირდებათ გამეორებების სერიის 
# შესრულება სხვა გამეორების შიგნით, მაგალითად, როდესაც მუშაობთ მრავალგანზომილებიან მონაცემებთან (მაგ., მატრიცები, სიების სიები) ან 
# როდესაც ქმნით ერთეულების კომბინაციებს.

for i in range(3):  
    for j in range(2):  
        print(f"i = {i}, j = {j}")
