
// JavaScript array.filter()


// JavaScript-ის filter მეთოდი გამოიყენება მასივის იმ ელემენტების ამოსარჩევად, რომლებიც აკმაყოფილებენ განსაზღვრულ კრიტერიუმებს. შედეგი არის ახალი მასივი მხოლოდ იმ ელემენტებით, რომლებიც კრიტერიუმს ემთხვევა.

 

const numbers = [1, 2, 3, 4, 5];
const evenNumbers = numbers.filter((number) => number % 2 === 0);
console.log(evenNumbers);
 

// როგორ მუშაობს:

// filter იღებს callback ფუნქციას, რომელიც თითოეულ ელემენტს ამოწმებს.

// ფუნქცია უნდა დააბრუნოს true ან false.

// თუ true, ელემენტი შედის ახალ მასივში.

// თუ false, ელემენტი გამოტოვებულია.

// საბოლოოდ, შეიქმნება ახალი მასივი.
