// ფუნქციები JavaScript-ში
// ფუნქცია არის კოდის ბლოკი, რომელიც შეგიძლიათ გამოიყენოთ მრავალჯერ. იგი ხელს უწყობს კოდის ორგანიზებას, წაკითხვადობას და გამეორების თავიდან აცილებას.

// მაგალითი: ფუნქციის შექმნა და გამოძახება

// function greet(name) - ფუნქციის შექმნა, სადაც name არის პარამეტრი.

// console.log - ასრულებს ფუნქციის შიგნით კოდს.

// greet("ანა") - ფუნქციის გამოძახება არგუმენტით "ანა".

// ფუნქციები JavaScript-ში აუცილებელია ეფექტური კოდის წერისთვის.


function greet(name) {
    console.log("გამარჯობა, " + name + "!");
  }
  
  greet("ანა");
  greet("ნიკა");  
  