# Python CONDITIONAL EXPRESSIONS 

# Python-ში პირობითი გამოსახულებები (Conditional Expressions) საშუალებას გაძლევთ დაწეროთ მოკლე და მარტივი განცხადებები გადაწყვეტილებების მისაღებად. ისინი ხშირად ცნობილია როგორც ტერნარული ოპერატორები, რადგან მოიცავს სამ ნაწილს: პირობას, გამოსახულებას, რომელიც შესრულდება თუ პირობა მართალია, და გამოსახულებას, რომელიც შესრულდება თუ პირობა მცდარია.

# პირობითი გამოსახულების მაგალითი
age = 18
status = "ზრდასრული" if age >= 18 else "მცირეწლოვანი"
print(status)   


# პირობა (ასაკი >= 18) ფასდება.

# თუ პირობა მართალია, შესრულდება პირველი გამოსახულება ("ზრდასრული").

# თუ პირობა მცდარია, შესრულდება მეორე გამოსახულება ("მცირეწლოვანი").

# ჩადგმული პირობითი გამოსახულებები:
# შეგიძლიათ ჩადგმული პირობითი გამოსახულებები გამოიყენოთ უფრო რთული ლოგიკისთვის:


points = 85
rewiews = "A" if points >= 90 else "B" if points >= 80 else "C"
print(rewiews)                                  
