// Break და Continue განცხადებები JavaScript-ში
// JavaScript-ში break და continue განცხადებები გამოიყენება ციკლების კონტროლისთვის:

// 1. break
// break გამოიყენება, რომ ციკლი სრულად შეწყდეს და პროგრამა გაგრძელდეს ციკლის გარეთ.

 
for (let i = 1; i <= 5; i++) {
  if (i === 3) {
    break;  
  }
  console.log(i);
}
 



// 2. continue
// continue გამოიყენება, რომ ციკლის კონკრეტული განმეორება გამოტოვოთ და პროგრამა გადავიდეს შემდეგ განმეორებაზე.

 
for (let i = 1; i <= 5; i++) {
  if (i === 3) {
    continue;  
  }
  console.log(i);
}
 

// break გამოიყენება ციკლის სრულად შესაწყვეტად, ხოლო continue მხოლოდ კონკრეტული განმეორების გამოტოვებისთვის. ეს განცხადებები იძლევა მოქნილობას ციკლების მართვაში.