# Python-ში if, elif და else ოპერატორები გამოიყენება პირობითი ლოგიკის შესაქმნელად. ისინი საშუალებას გაძლევთ პროგრამაში სხვადასხვა კოდის ბლოკი შეასრულოთ, დამოკიდებულია პირობებზე.
 

# if: ამოწმებს პირობას და თუ ის მართალია (True), ასრულებს კოდის ბლოკს.

# elif: გამოიყენება დამატებითი პირობების შესამოწმებლად, თუ წინა if პირობა არ შესრულდა.

# else: ასრულებს კოდის ბლოკს, თუ არცერთი if ან elif პირობა არ შესრულდა.

 
 
age = int(input("შეიყვანეთ age: "))

if age > 0:
    print("age დადებითია.")
elif age == 0:
    print("age ნულია.")
else:
    print("age უარყოფითია.")